use crate::service::mchd::home_mchd_power::HomePowerInfo;

pub const FNS02: HomePowerInfo = HomePowerInfo { code: "2_FNS02", name: "Представлять налоговую декларацию, другую отчетность" };
pub const FNS03: HomePowerInfo = HomePowerInfo { code: "2_FNS03", name: "Получать документы в налоговом органе" };
pub const FNS05: HomePowerInfo = HomePowerInfo { code: "2_FNS05", name: "Подписывать документы, используемые при постановке на учет и снятии с учета и сообщении сведений, установленных Налоговым кодексом Российской Федерации" };
pub const FNS06: HomePowerInfo = HomePowerInfo { code: "2_FNS06", name: "Представлять документы, используемые при постановке на учет и снятии с учета и сообщении сведений, установленных Налоговым кодексом Российской Федерации" };
pub const FNS07: HomePowerInfo = HomePowerInfo { code: "2_FNS07", name: "Получать от налогового органа документы, подтверждающие постановку на учет и снятие с учета" };
pub const FNS08: HomePowerInfo = HomePowerInfo { code: "2_FNS08", name: "Подписывать документы, используемые при учете банковских счетов (в том числе открытых в банках и иных организациях финансового рынка за пределами территории Российской Федерации) и электронных средств платежа" };
pub const FNS09: HomePowerInfo = HomePowerInfo { code: "2_FNS09", name: "Представлять документы, используемые при учете банковских счетов (в том числе открытых в банках и иных организациях финансового рынка за пределами территории Российской Федерации) и электронных средств платежа" };
pub const FNS10: HomePowerInfo = HomePowerInfo { code: "2_FNS10", name: "Представлять документы по применению специальных налоговых режимов, документы по налогу на игорный бизнес" };
pub const FNS11: HomePowerInfo = HomePowerInfo { code: "2_FNS11", name: "Получать в налоговом органе документы по применению специальных налоговых режимов, документы по налогу на игорный бизнес" };
pub const FNS17: HomePowerInfo = HomePowerInfo { code: "2_FNS17", name: "Подписывать заявление на зачет/возврат налога" };
pub const FNS18: HomePowerInfo = HomePowerInfo { code: "2_FNS18", name: "Подписывать заявления о ввозе товаров и уплате косвенных налогов" };
pub const FNS19: HomePowerInfo = HomePowerInfo { code: "2_FNS19", name: "Получать заявления о ввозе товаров и уплате косвенных налогов" };
pub const FNS40: HomePowerInfo = HomePowerInfo { code: "2_FNS40", name: "Подписывать и направлять банковскую гарантию в налоговый орган" };
pub const FNS24: HomePowerInfo = HomePowerInfo { code: "2_FNS24", name: "Подписывать, представлять и получать от налогового органа документы по снятию контрольно-кассовой техники с регистрационного учета" };
pub const FNS25: HomePowerInfo = HomePowerInfo { code: "2_FNS25", name: "Подписывать и представлять перечень автоматических устройств для расчетов" };
pub const FNS28: HomePowerInfo = HomePowerInfo { code: "2_FNS28", name: "Подписывать и представлять отчет об операциях с товарами, подлежащими прослеживаемости, документы, содержащие реквизиты прослеживаемости, и иные документы (информацию) в рамках национальной системы прослеживаемости" };
pub const FNS29: HomePowerInfo = HomePowerInfo { code: "2_FNS29", name: "Получать от налогового органа квитанцию о присвоении регистрационного номера партии товара, подлежащего прослеживаемости" };
pub const FNS30: HomePowerInfo = HomePowerInfo { code: "2_FNS30", name: "Получать документы, используемые при учете и контроле банковских счетов и электронных средств платежа" };
pub const FNS31: HomePowerInfo = HomePowerInfo { code: "2_FNS31", name: "Подписывать, получать и представлять документы и информацию в рамках проверки соблюдения валютного законодательства Российской Федерации" };
pub const FNS32: HomePowerInfo = HomePowerInfo { code: "2_FNS32", name: "Получать запросы налогового органа и представлять документы и информацию по запросам в соответствии с валютным законодательством Российской Федерации" };
pub const FNS33: HomePowerInfo = HomePowerInfo { code: "2_FNS33", name: "Подписывать и представлять отчеты по зарубежным счетам, получать уведомления налогового органа о необходимости представления исправленного (уточненного) отчета и (или) надлежащим образом оформленных подтверждающих документов" };
pub const FNS35: HomePowerInfo = HomePowerInfo { code: "2_FNS35", name: "Подписывать, получать и представлять документы и информацию в рамках производства по делам об административных правонарушениях за нарушения валютного законодательства Российской Федерации, в том числе процессуальные документы" };
pub const FNS36: HomePowerInfo = HomePowerInfo { code: "2_FNS36", name: "Представлять заявление на получение доступа к Личному кабинету" };
pub const FNS20: HomePowerInfo = HomePowerInfo { code: "2_FNS20", name: "Подписывать документы по применению специальных налоговых режимов, документы по налогу на игорный бизнес" };
pub const FNS21: HomePowerInfo = HomePowerInfo { code: "2_FNS21", name: "Подписывать документы (информацию)" };
pub const FNS22: HomePowerInfo = HomePowerInfo { code: "2_FNS22", name: "Представлять документы (информацию)" };
pub const FNS23: HomePowerInfo = HomePowerInfo { code: "2_FNS23", name: "Подписывать, представлять и получать от налогового органа документы по регистрации (перерегистрации) контрольно-кассовой техники" };
pub const FNS39: HomePowerInfo = HomePowerInfo { code: "2_FNS39", name: "Подписывать и представлять запрос на представление сведений, составляющих налоговую тайну" };
pub const FNS37: HomePowerInfo = HomePowerInfo { code: "2_FNS37", name: "Подписывать и представлять согласие налогоплательщика (плательщика страховых взносов) на представление сведений, составляющих налоговую тайну, со стороны лица, раскрывающего сведения, составляющие налоговую тайну" };
pub const FNS38: HomePowerInfo = HomePowerInfo { code: "2_FNS38", name: "Подписывать и представлять согласие налогоплательщика (плательщика страховых взносов) на представление сведений, составляющих налоговую тайну, со стороны лица, запрашивающего сведения, составляющие налоговую тайну" };
pub const FNS99: HomePowerInfo = HomePowerInfo { code: "2_FNS99", name: "Представлять интересы налогоплательщика в отношениях с налоговыми органами (полные полномочия)" };
pub const FNS41: HomePowerInfo = HomePowerInfo { code: "2_FNS41", name: "Подписывать и представлять уведомления об участии в международной группе компаний, страновые отчеты международной группы компаний" };
pub const FNSRAMAURAU: HomePowerInfo = HomePowerInfo { code: "FNS_RAM_AU_RAU", name: "Право на представление интересов арбитражного управляющего в рабочем кабинете Регистра арбитражных управляющих" };
pub const FNSRAMSROAURAU: HomePowerInfo = HomePowerInfo { code: "FNS_RAM_SROAU_RAU", name: "Право на представление интересов саморегулируемой организации арбитражных управляющих в рабочем кабинете Регистра арбитражных управляющих" };
pub const FNSOFR340FZ: HomePowerInfo = HomePowerInfo { code: "FNS_OFR_340FZ", name: "Представление в адрес ФНС России финансовой информации в соответствии с главой 20.1 Налогового кодекса Российской Федерации" };
pub const FNSOFR173FZ: HomePowerInfo = HomePowerInfo { code: "FNS_OFR_173FZ", name: "Представление в адрес ФНС России информации в соответствии с Федеральным законом от 28.06.2014 № 173-ФЗ" };
pub const FNSVPD001: HomePowerInfo = HomePowerInfo { code: "FNS_VPD_001", name: "Регистрировать организацию на платформе поставки данных «ВПД» ФНС России от имени доверителя" };
pub const FNSVPD002: HomePowerInfo = HomePowerInfo { code: "FNS_VPD_002", name: "Подписывать оферту или соглашение об информационном взаимодействии с ФНС России на платформе поставки данных «ВПД» ФНС России от имени доверителя" };
pub const FNSVPD003: HomePowerInfo = HomePowerInfo { code: "FNS_VPD_003", name: "Расторгать оферту или соглашение об информационном взаимодействии с ФНС России на платформе поставки данных «ВПД» ФНС России от имени доверителя" };



